perfcake/src/main/resources/messages/5kB_soap_addressing.xml

<?xml version="1.0"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
   <env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:To>http://localhost:8080/Plain_ws_ejb_addressing/HelloWorldWS</wsa:To>
      <wsa:Action>sayHello</wsa:Action>
      <wsa:MessageID>urn:uuid:e7cb916f-34ca-43b7-b9b4-ca823406bf95</wsa:MessageID>
      <wsa:ReplyTo>
         <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      </wsa:ReplyTo>
   </env:Header>
   <env:Body>
      <ns1:sayHellop xmlns:ns1="http://org.jboss.ws/samples/wsaddressing">
         <toWhom>abcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodani_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahoda
            abcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodani_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahoda
            abcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodani_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahoda
            abcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodani_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahoda
            abcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodani_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahoda
            abcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pada_jahoda,kterou_sni_pan_Lahodani_pan_Lahodaabcdefghijklmnopqrstuvwxyz0123456789!@#$%^°*()_+-=[]{}:",.?/`~Pada,pa
         </toWhom>
      </ns1:sayHellop>
   </env:Body>
</env:Envelope>
